public class HelloWorld {

    public static void main(String [] args){
        System.out.println("Hello World!"); // в метод println передаются параметры в круглых скобках
    // Че произойдет  Метод PrintLN возьмёт параметры и выведет их в консоль
        // в папке out --> production --> будет java файл после компиляции собраный в байт код для чтения компьюетером.
    }
    // в круглых скобках ПАРАМЕТРЫ МЕТОДА
    // Метод это фукнция которая принимает на вход данные  и сопоставляет входнным данным с данными на выходе
    // Метод живёт именно внутри класса.
    // компиляция - перевод кода,который я пишу в редакторе кода в код понятный машине.( этот перевод делает JDK)
    // в нём есть класс ремонт ванной,в котором есть классы туалет,ванная и тд
    // Java файл - код на языке джава.

    // О КЛАССЕ
    // класс - способ логически отделить составную часть общего. -- пример Ремонт квартиры это большой проект.
    // В классе HelloWorld всё,что между фигурными {скобками это СОДЕРЖИМОЕ КЛАССА.}
    // В классе есть методы.  Методы это действия. Класс унитаз его метод смывать,засорятся :D
    // МЕТОДЫ это действия! Main - Стартовая точка. Все другие методы вызываются в теле метода MAIN




}
